Documents/ГАЛ_ПриемкаДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ГАЛ_ПриемкаДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ГАЛ_ДенежныеСредстваМУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурьерЭкспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ГАЛ_ТипыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаДоставку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ГАЛ_ЗаказНаДоставку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ГАЛ_Маршруты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ГАЛ_Маршруты</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусМаршрута</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГАЛ_СтатусыМаршрутногоЛиста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ГАЛ_ЗаказНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КурьерЭкспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ГАЛ_ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ГАЛ_ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ГАЛ_ПриемкаДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
//Нажатие кнопки заполнить
&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ГАЛ_МаршрутыСрезПоследних.ЗаказНаДоставку,
	                |	ГАЛ_МаршрутыСрезПоследних.ЗаказНаДоставку.СуммаДокумента КАК СуммаДокумента
	                |ИЗ
	                |	РегистрСведений.ГАЛ_Маршруты.СрезПоследних КАК ГАЛ_МаршрутыСрезПоследних
	                |ГДЕ
	                |	ГАЛ_МаршрутыСрезПоследних.ДатаДоставки = &ДатаДоставки
	                |	И ГАЛ_МаршрутыСрезПоследних.КурьерЭкспедитор = &КурьерЭкспедитор";
	 
	 Запрос.УстановитьПараметр("ДатаДоставки", Объект.ДатаДоставки);
	 Запрос.УстановитьПараметр("КурьерЭкспедитор", Объект.КурьерЭкспедитор);
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Если Выборка.Количество()> 0 Тогда
		 Пока Выборка.Следующий() Цикл
			 
			   НоваяСтрока = Объект.Оплаты.Добавить();
			   НоваяСтрока.ЗаказНаДоставку = Выборка.ЗаказНаДоставку;
			   НоваяСтрока.ТипДС = Перечисления.ГАЛ_ТипыДенежныхСредств.Наличные;
			   НоваяСтрока.Сумма = Выборка.СуммаДокумента;
		 КонецЦикла;
	 КонецЕсли;
	 
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаДоставки) Тогда
		СообщитьП=Новый СообщениеПользователю;
		СообщитьП.Текст = "Необходимо заполнить дату доставки!";
		СообщитьП.Поле="ДатаДоставки";
		СообщитьП.ПутьКДанным = "Объект";
		СообщитьП.Сообщить();
		Возврат;
	КонецЕсли;
	
		Если НЕ ЗначениеЗаполнено(Объект.КурьерЭкспедитор) Тогда
		СообщитьП=Новый СообщениеПользователю;
		СообщитьП.Текст = "Необходимо заполнить курьера!";
		СообщитьП.Поле="КурьерЭкспедитор";
		СообщитьП.ПутьКДанным = "Объект";
		СообщитьП.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Объект.Оплаты.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
		ЭтотОбъект);	
		
		ПоказатьВопрос(Оповещение,
		"Очистить табличную часть перед заполнением?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Внимание" // (необ.) заголовок
		);   
	Иначе
		КомандаЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры


//Обработка после вопроса
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        Объект.Оплаты.Очистить();
		КомандаЗаполнитьНаСервере();
	КонецЕсли;	
 
КонецПроцедуры
